In [17]:
import pandas as pd
import numpy as np

# 读取文件

In [18]:
df01=pd.read_excel('data1.xlsx')
df01

    name  score  age
0    joe     90   18
1  susan    100   23

In [19]:
df01=pd.read_csv('data2.txt',sep=';',header=None)
df01

       0   1      2
0    joe  18    men
1  susan  19  women

# 过滤数据

In [20]:
#字典中的value只能是一维数组
df01 = pd.DataFrame({
    
    'name':['joe','susan','anne'],
    'sex':['mem','women','men'],
    'age':[18,19,20],
    'classid':3
},index=['one','two','three'])
print(df01)

       age  classid   name    sex
one     18        3    joe    mem
two     19        3  susan  women
three   20        3   anne    men

In [21]:
print(df01.columns)

Index(['age', 'classid', 'name', 'sex'], dtype='object')

In [22]:
#通过列切片
df01[df01.columns[2:]]

        name    sex
one      joe    mem
two    susan  women
three   anne    men

# 缺失值处理

In [30]:
df01 = pd.DataFrame(np.random.randint(1,9,size=(4,4)))
df01

   0  1  2  3
0  3  4  8  4
1  1  4  7  2
2  6  3  6  8
3  5  8  3  6

In [42]:
df01.loc[1:2,1] = np.NaN
df01.loc[1:2,2] = np.NaN
df01.loc[1:2,3] = np.NaN
df01

   0    1    2    3
0  8  4.0  8.0  3.0
1  7  NaN  NaN  NaN
2  2  NaN  NaN  NaN
3  5  5.0  7.0  2.0

In [43]:
df01.dropna() #删除NaN的行

   0    1    2    3
0  8  4.0  8.0  3.0
3  5  5.0  7.0  2.0

In [44]:
df01.dropna(how = 'all')  #删除全部是NaN的行

   0    1    2    3
0  8  4.0  8.0  3.0
1  7  NaN  NaN  NaN
2  2  NaN  NaN  NaN
3  5  5.0  7.0  2.0

In [45]:
df01.ix[1,0] = np.NaN
df01

     0    1    2    3
0  8.0  4.0  8.0  3.0
1  NaN  NaN  NaN  NaN
2  2.0  NaN  NaN  NaN
3  5.0  5.0  7.0  2.0

In [46]:
df01.dropna(how = 'all')  #删除全部是NaN的行

     0    1    2    3
0  8.0  4.0  8.0  3.0
2  2.0  NaN  NaN  NaN
3  5.0  5.0  7.0  2.0

In [47]:
df01 = pd.DataFrame(np.random.randint(1,9,size=(4,4)))
df01.loc[1:2,1] = np.NaN
df01.loc[1:2,2] = np.NaN
df01.loc[1:2,3] = np.NaN
df01

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  NaN  NaN  NaN
2  3  NaN  NaN  NaN
3  4  5.0  6.0  7.0

In [48]:
df01.dropna(axis =1)  #删除包含NaN的列

   0
0  8
1  8
2  3
3  4

In [49]:
df01

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  NaN  NaN  NaN
2  3  NaN  NaN  NaN
3  4  5.0  6.0  7.0

In [50]:
df01.fillna(0)

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  0.0  0.0  0.0
2  3  0.0  0.0  0.0
3  4  5.0  6.0  7.0

In [51]:
df01

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  NaN  NaN  NaN
2  3  NaN  NaN  NaN
3  4  5.0  6.0  7.0

In [52]:
df01.fillna({0:1,1:1,2:2,3:3})

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  1.0  2.0  3.0
2  3  1.0  2.0  3.0
3  4  5.0  6.0  7.0

In [56]:
df01

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  NaN  NaN  NaN
2  3  NaN  NaN  NaN
3  4  5.0  6.0  7.0

In [57]:
df01.ffill()

   0    1    2    3
0  8  7.0  7.0  1.0
1  8  7.0  7.0  1.0
2  3  7.0  7.0  1.0
3  4  5.0  6.0  7.0

# 数学统计方法

In [79]:
df01 = pd.DataFrame(np.random.randint(1,9,size=(5,4)))
df01

   0  1  2  3
0  5  5  5  6
1  6  3  8  6
2  5  2  7  4
3  6  6  7  6
4  6  6  2  8

In [80]:
df01.sum()

0    28
1    22
2    29
3    30
dtype: int64

In [81]:
df01.sum(axis=0)  #0：按行，1：按列求

0    28
1    22
2    29
3    30
dtype: int64

In [82]:
df01.sum(axis=1)

0    21
1    23
2    18
3    25
4    22
dtype: int64

In [83]:
df01.min()

0    5
1    2
2    2
3    4
dtype: int32

In [84]:
df01.max()

0    6
1    6
2    8
3    8
dtype: int32

In [87]:
df01.quantile(0.75)

0    6.0
1    6.0
2    7.0
3    6.0
Name: 0.75, dtype: float64

In [86]:
df01.median()  #中位数

0    6.0
1    5.0
2    7.0
3    6.0
dtype: float64

In [90]:
df01.cumsum()

    0   1   2   3
0   5   5   5   6
1  11   8  13  12
2  16  10  20  16
3  22  16  27  22
4  28  22  29  30

In [92]:
df01

   0  1  2  3
0  5  5  5  6
1  6  3  8  6
2  5  2  7  4
3  6  6  7  6
4  6  6  2  8

In [91]:
df01.pct_change()  #计算百分数变化

          0         1         2         3
0       NaN       NaN       NaN       NaN
1  0.200000 -0.400000  0.600000  0.000000
2 -0.166667 -0.333333 -0.125000 -0.333333
3  0.200000  2.000000  0.000000  0.500000
4  0.000000  0.000000 -0.714286  0.333333

In [93]:
df01.describe()

              0        1         2         3
count  5.000000  5.00000  5.000000  5.000000
mean   5.600000  4.40000  5.800000  6.000000
std    0.547723  1.81659  2.387467  1.414214
min    5.000000  2.00000  2.000000  4.000000
25%    5.000000  3.00000  5.000000  6.000000
50%    6.000000  5.00000  7.000000  6.000000
75%    6.000000  6.00000  7.000000  6.000000
max    6.000000  6.00000  8.000000  8.000000

# 相关系数与协方差

In [97]:
df01 = pd.DataFrame({
    'GDP':[400,500,600,700],
    'forgin_trade':[100,200,300,400],
    'year':['2012','2013','2014','2015']
    
})
df01

   GDP  forgin_trade  year
0  400           100  2012
1  500           200  2013
2  600           300  2014
3  700           400  2015

In [103]:
df01.cov()  #协方差

                       GDP   forgin_trade
GDP           16666.666667  -16666.666667
forgin_trade -16666.666667  170000.000000

In [110]:
df01 = pd.DataFrame({
    'GDP':[400,500,600,700],
    'forgin_trade':[1000,200,1000,400],
    'year':['2012','2013','2014','2015']
    
})
df01

   GDP  forgin_trade  year
0  400          1000  2012
1  500           200  2013
2  600          1000  2014
3  700           400  2015

In [111]:
df01.cov()

                       GDP   forgin_trade
GDP           16666.666667  -16666.666667
forgin_trade -16666.666667  170000.000000

In [112]:
df01.corr()  #相关系数

                   GDP  forgin_trade
GDP           1.000000     -0.313112
forgin_trade -0.313112      1.000000

# 层次索引

In [118]:
print('使用列生成层次索引')
frame = pd.DataFrame({'a':range(7),
                   'b':range(7, 0, -1),
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd':[0, 1, 2, 0, 1, 2, 3]})
frame

使用列生成层次索引

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [119]:
frame.set_index(['c','d'])  #把c/d列变成索引

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [123]:
frame.set_index(['c','d'],drop=False)  #列已然保留

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [126]:
frame2=frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [127]:
frame2.reset_index()  #reset_index 恢复

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1